In [60]:
import numpy as np
import pandas as pd

# Numpy

#### task 1

In [42]:
a = np.array([[1, 6],
              [2, 8],
              [3, 11],
              [3, 10],
              [1, 7]])

mean_a = a.mean(axis=0)
mean_a

array([2. , 8.4])

#### task 2

In [48]:
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

#### task 3

In [59]:
a_centered_sp = a_centered[:, 0] @ a_centered[:, 1] / (len(a) - 1)
a_centered_sp

2.0

#### task 4 **

In [50]:
np.cov(a.T)[0, 1]

2.0

# Pandas

#### task 1

In [78]:
author_id = pd.Series([1, 2, 3])
author_name = pd.Series(['Тургенев', 'Чехов', 'Островский'])
authors = pd.DataFrame({'author_id': author_id, 'author_name': author_name})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [76]:
author_id = pd.Series([1, 1, 1, 2, 2, 3, 3])
book_title = pd.Series(['Отцы и дети',
                        'Рудин',
                        'Дворянское гнездо',
                        'Толстый и тонкий',
                        'Дама с собачкой',
                        'Гроза',
                        'Таланты и поклонники'])
price = pd.Series([450, 300, 350, 500, 450, 370, 290])
book = pd.DataFrame({'author_id': author_id, 'book_title': book_title, 'price': price})
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

#### task 2

In [100]:
author_price = pd.merge(authors, book, on='author_id')
author_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

#### task 3

In [94]:
top5 = author_price.sort_values('price', ascending=False)[0:5]
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

#### task 4

In [121]:
# Serieses with author's price lists
turgenev = author_price[author_price['author_name'] == 'Тургенев']['price']
chehov = author_price[author_price['author_name'] == 'Чехов']['price']
ostrovskiy = author_price[author_price['author_name'] == 'Островский']['price']

authors_stat = pd.DataFrame({'author_name': author_name,
                             'min_price': [turgenev.min(), chehov.min(), ostrovskiy.min()],
                             'max_price': [turgenev.max(), chehov.max(), ostrovskiy.max()],
                             'mean_price': [turgenev.mean(), chehov.mean(), ostrovskiy.mean()]})
authors_stat

  author_name  min_price  max_price  mean_price
0    Тургенев        300        450  366.666667
1       Чехов        450        500  475.000000
2  Островский        290        370  330.000000